assets/plantuml.puml
@startuml
skinparam nodesep 10
class "TextValue"
class "PortionOfSubstance" {
    {field} "sample_state_information": "SampleStateEnum" [opt]
    {field} "substance_role": "SubstanceRoleEnum" [opt]
    {field} "type": "uriorcurie" [req]
}
class "SubstanceEntity" {
    {field} "alternative_names": "string" [0..*]
    {field} "id"(i): "uriorcurie" [req]
    {field} "name"(i): "string" [opt]
    {field} "description"(i): "string" [opt]
    {field} "alternative_identifiers"(i): "uriorcurie" [0..*]
    {field} "type"(i): "uriorcurie" [req]
}
class "ChemicalEntity" {
    {field} "chemical_formula": "string" [opt]
    {field} "inchi": "string" [opt]
    {field} "inchi_key": "string" [opt]
    {field} "smiles": "string" [0..*]
    {field} "alternative_names"(i): "string" [0..*]
    {field} "id"(i): "uriorcurie" [req]
    {field} "name"(i): "string" [opt]
    {field} "description"(i): "string" [opt]
    {field} "alternative_identifiers"(i): "uriorcurie" [0..*]
    {field} "type"(i): "uriorcurie" [req]
}
class "OntologyClass"
"PortionOfSubstance" --> "0..1" "SubstanceEntity" : "known_as"
"SubstanceEntity" ^-- "ChemicalEntity"
"OntologyClass" ^-- "SubstanceEntity"
class "Study"
class "Mixture"
class "Solution" {
    {field} "type"(i): "uriorcurie" [req]
}
"Mixture" ^-- "Solution"
class "ReactionParticipant"
class "QuantityValue"
class "Protocol"
class "ProcessedSample"
class "DissolvingProcess" {
    {field} "solvent": "string" [req]
    {field} "id": "uriorcurie" [req]
    {field} "processing_institution"(i): "ProcessingInstitutionEnum" [opt]
    {field} "start_date"(i): "string" [opt]
    {field} "end_date"(i): "string" [opt]
    {field} "qc_status"(i): "StatusEnum" [opt]
    {field} "qc_comment"(i): "string" [opt]
    {field} "name"(i): "string" [opt]
    {field} "description"(i): "string" [opt]
    {field} "alternative_identifiers"(i): "uriorcurie" [0..*]
    {field} "type"(i): "uriorcurie" [req]
}
class "Extraction" {
    {field} "extraction_target": "ExtractionTargetEnum" [opt]
    {field} "id": "uriorcurie" [req]
    {field} "processing_institution"(i): "ProcessingInstitutionEnum" [opt]
    {field} "start_date"(i): "string" [opt]
    {field} "end_date"(i): "string" [opt]
    {field} "qc_status"(i): "StatusEnum" [opt]
    {field} "qc_comment"(i): "string" [opt]
    {field} "name"(i): "string" [opt]
    {field} "description"(i): "string" [opt]
    {field} "alternative_identifiers"(i): "uriorcurie" [0..*]
    {field} "type"(i): "uriorcurie" [req]
}
class "ChemicalConversionProcess" {
    {field} "chemical_conversion_category": "ChemicalConversionCategoryEnum" [opt]
    {field} "id": "uriorcurie" [req]
    {field} "processing_institution"(i): "ProcessingInstitutionEnum" [opt]
    {field} "start_date"(i): "string" [opt]
    {field} "end_date"(i): "string" [opt]
    {field} "qc_status"(i): "StatusEnum" [opt]
    {field} "qc_comment"(i): "string" [opt]
    {field} "name"(i): "string" [opt]
    {field} "description"(i): "string" [opt]
    {field} "alternative_identifiers"(i): "uriorcurie" [0..*]
    {field} "type"(i): "uriorcurie" [req]
}
"PortionOfSubstance" *--> "0..1" "QuantityValue" : "volume"
"PortionOfSubstance" *--> "0..1" "QuantityValue" : "source_concentration"
"PortionOfSubstance" *--> "0..1" "QuantityValue" : "mass"
"PortionOfSubstance" *--> "0..1" "QuantityValue" : "final_concentration"
"DissolvingProcess" *--> "0..1" "PortionOfSubstance" : "solubilizing_agent"
"Extraction" *--> "0..*" "PortionOfSubstance" : "substances_used"
"Mixture" *--> "0..*" "PortionOfSubstance" : "substances_used"
"ChemicalConversionProcess" *--> "0..*" "PortionOfSubstance" : "substances_used"
class "PersonValue"
abstract "NamedThing"
class "MetabolomicsAnalysis"
class "MetaboliteQuantification" {
    {field} "alternative_identifiers": "uriorcurie" [0..*]
    {field} "highest_similarity_score": "float" [opt]
    {field} "type": "uriorcurie" [req]
}
"MetaboliteQuantification" --> "0..1" "ChemicalEntity" : "metabolite_quantified"
"MetabolomicsAnalysis" *--> "0..*" "MetaboliteQuantification" : "has_metabolite_quantifications"
class "MaterialProcessing"
class "MassSpectrometry" {
    {field} "acquisition_category": "AcquisitionCategoryEnum" [opt]
    {field} "acquisition_strategy": "AcquisitionStrategyEnum" [opt]
    {field} "resolution_category": "ResolutionCategoryEnum" [opt]
    {field} "mass_analyzer": "MassAnalyzerEnum" [opt]
    {field} "ionization_source": "IonizationSourceEnum" [opt]
    {field} "mass_spectrum_collection_mode": "MassSpectrumCollectionModeEnum" [opt]
    {field} "polarity_mode": "PolarityModeEnum" [opt]
    {field} "id": "uriorcurie" [req]
    {field} "add_date"(i): "string" [opt]
    {field} "analyte_category"(i): "AnalyteCategoryEnum" [req]
    {field} "gold_sequencing_project_identifiers"(i): "external_identifier" [0..*]
    {field} "insdc_bioproject_identifiers"(i): "external_identifier" [0..*]
    {field} "insdc_experiment_identifiers"(i): "external_identifier" [0..*]
    {field} "mod_date"(i): "string" [opt]
    {field} "ncbi_project_name"(i): "string" [opt]
    {field} "processing_institution"(i): "ProcessingInstitutionEnum" [opt]
    {field} "start_date"(i): "string" [opt]
    {field} "end_date"(i): "string" [opt]
    {field} "qc_status"(i): "StatusEnum" [opt]
    {field} "qc_comment"(i): "string" [opt]
    {field} "name"(i): "string" [opt]
    {field} "description"(i): "string" [opt]
    {field} "alternative_identifiers"(i): "uriorcurie" [0..*]
    {field} "type"(i): "uriorcurie" [req]
}
abstract "FluidHandling" {
    {field} "id"(i): "uriorcurie" [req]
    {field} "processing_institution"(i): "ProcessingInstitutionEnum" [opt]
    {field} "start_date"(i): "string" [opt]
    {field} "end_date"(i): "string" [opt]
    {field} "qc_status"(i): "StatusEnum" [opt]
    {field} "qc_comment"(i): "string" [opt]
    {field} "name"(i): "string" [opt]
    {field} "description"(i): "string" [opt]
    {field} "alternative_identifiers"(i): "uriorcurie" [0..*]
    {field} "type"(i): "uriorcurie" [req]
}
abstract "DataGeneration"
"MassSpectrometry" --> "0..1" "FluidHandling" : "eluent_introduction"
"DataGeneration" ^-- "MassSpectrometry"
class "Instrument"
class "DirectInfusionProcess"
class "ChromatographicSeparationProcess" {
    {field} "has_calibration": "string" [opt]
    {field} "chromatographic_category": "ChromatographicCategoryEnum" [opt]
    {field} "ordered_mobile_phases": "string" [0..*]
    {field} "stationary_phase": "StationaryPhaseEnum" [opt]
    {field} "id": "uriorcurie" [req]
    {field} "processing_institution"(i): "ProcessingInstitutionEnum" [opt]
    {field} "start_date"(i): "string" [opt]
    {field} "end_date"(i): "string" [opt]
    {field} "qc_status"(i): "StatusEnum" [opt]
    {field} "qc_comment"(i): "string" [opt]
    {field} "name"(i): "string" [opt]
    {field} "description"(i): "string" [opt]
    {field} "alternative_identifiers"(i): "uriorcurie" [0..*]
    {field} "type"(i): "uriorcurie" [req]
}
"FluidHandling" ^-- "DirectInfusionProcess"
"FluidHandling" ^-- "ChromatographicSeparationProcess"
"MaterialProcessing" ^-- "FluidHandling"
class "FailureCategorization"
class "Database"
"Extraction" --> "1..*" "NamedThing" : "has_output"
"Extraction" *--> "0..1" "QuantityValue" : "volume"
"Extraction" *--> "0..1" "QuantityValue" : "input_mass"
"Database" *--> "0..*" "Extraction" : "extraction_set"
"MaterialProcessing" ^-- "Extraction"
"DissolvingProcess" *--> "0..1" "QuantityValue" : "temperature"
"DissolvingProcess" *--> "0..1" "QuantityValue" : "duration"
"MaterialProcessing" ^-- "DissolvingProcess"
class "DataObject"
"ChromatographicSeparationProcess" *--> "0..1" "QuantityValue" : "temperature"
"ReactionParticipant" --> "0..1" "ChemicalEntity" : "chemical"
"Database" *--> "0..*" "ChemicalEntity" : "chemical_entity_set"
"ChemicalConversionProcess" *--> "0..1" "QuantityValue" : "substances_volume"
"ChemicalConversionProcess" *--> "0..1" "QuantityValue" : "temperature"
"ChemicalConversionProcess" *--> "0..1" "QuantityValue" : "duration"
"MaterialProcessing" ^-- "ChemicalConversionProcess"
@enduml
